[{"title":"More Fairlight, 2 links","content":"Fairlight is the secret composer that you love:\nhttps://blog.scienceandmediamuseum.org.uk/fairlight-cmi-playlist\n\nReally cool Fairlight video: \nhttps://www.youtube.com/watch?v=LagUDPSZfBQ","date":"2025-06-18T19:08:40.001Z"},{"title":"The Secret Composer, In the Studio","content":"Fairlight is the secret composer that you love:\n\nhttps://blog.scienceandmediamuseum.org.uk/fairlight-cmi-playlist/\n\nReally cool Fairlight video:\n\nhttps://www.youtube.com/watch?v=LagUDPSZfBQ","date":"2025-06-18T19:04:10.354Z"},{"title":"Kate Bush and her Fairlight","content":"How about that harp:\n\nhttps://www.reddit.com/r/synthesizers/comments/1h44b6c/kate_bush_and_her_fairlight_cmi/\n\nHere's an interview of Kate:\n\nhttps://www.youtube.com/shorts/TZgSv3pa6yk","date":"2025-06-18T18:59:26.333Z"},{"title":"Stripped, Single Purpose Interfaces Are Glorious","content":"Color? Swipe + Pinch?  How about plot, point and click?\n\nhttps://www.muzines.co.uk/articles/the-fairlight-explained/1482","date":"2025-06-18T18:53:12.614Z"},{"title":"Fairlight Waves","content":"Loving the bank of sine waves at 4:18m\n\nhttps://www.youtube.com/watch?v=1heKz1sEGKE","date":"2025-06-18T18:49:46.447Z"},{"title":"SARARR + Waves","content":"How about these waveform graphics the old Fairlight...Is this the way computer graphics should look like?  Haha!  \n\nhttps://www.failedmuso.com/the-story-of-sararr/\n\nAlso, The epic SARARR sound....","date":"2025-06-18T18:48:11.786Z"},{"title":"Fairlight CMI - Wave, waves, waves!","content":"You gotta love the graphics from the Fairlight CMI Sampler, right?  Like, c'mon?!\n\nhttps://www.reddit.com/r/synthesizers/comments/t6krkd/i_got_to_use_the_fairlight_cmi_at_work_it_was/","date":"2025-06-18T18:41:46.524Z"},{"title":"MPC Live 2 - Purpose Built vs Kitchen Sink","content":"To be or not to be....I really like my MPC Live II.  I use it to jam and make beats and part of what I really like about it is that it has some instrument plugins built-in now, which gives you quick and easy access to many different kinds of sounds from synthesizers to effects and drums.  What I am complaining about right now, is that in the name of moving technology forward, the interface has become increasingly more complicated, more computer like, more menu diving.  While the features are welcome, the more it feels like a computer, the less it's an MPC.  It certainly does have a instant access to many of the key features, but I find myself tripping over menus and losing the flow of the device, which has been it's BEST feature decades.  What do you think?  Flow or features?","date":"2025-06-18T18:19:20.780Z"},{"title":"Don't You Want These Sounds?","content":"After a couple hours of sound design, I got curious to see if anyone has done a synth study on the synths used in \"Don't You Want Me\".  This Youtube video from Alex Ball is so good.  He demonstrates the sound designs on many of the Human League's synthesizers and sequencers programmed by Martin Rushnet for their album, \"Dare\".\n\nhttps://www.youtube.com/watch?v=JR4WCPY4mBY","date":"2025-06-13T22:47:56.705Z"},{"title":"lm-1 drum machine jam","content":"This morning I decided to go back to basics and work on a simple drum machine and synth jam using just my MPC Live II. I own a lot of gear and I also make beats on my computer. Either way, it's easy to start stacking and stacking more elements or processing or effects and get distracted from the real foundation of the music. With that, I loaded up my favorite Linn LM-1 drum machine samples that I have loved for years. I'm applying some light filtering and shelving of these samples as if I was running them through my DJ mixer. So far, so good. I've got a nice stripped beat going. The next element I am working on is a lead synth sound that is similar to the lead synth sound in the Human Leaague's \"Don't You Want Me\".","date":"2025-06-13T19:32:53.793Z"},{"title":"hello world - no bullshit short posts","content":"i'm experimenting with building a very simple twitter-esque tool for short posts and journaling.  it's been done a million times.  i don't want to build a social network from it.  i don't want to build a super blog tool.  i just want a no bullshit short post tool.  it's for me for now.  maybe i'll make different pages for different topics or reasons or uses in my life.  but ultimately, i want it to feel like basic and about the short but thoughtful writings.  no influence.  no ai.","date":"2025-06-13T19:32:26.822Z"}]